Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus
An enumerated type containing possible results of the Path of Travel calculation.
Since:
2020
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.TemporaryModeFailureWireframe
Temporary mode cannot be set for the view because wireframe display style is set for the view.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.TemporaryModeFailureDataExist
Temporary mode cannot be set for the view because analysis data exist in the view.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.RevealObstaclesModeFailureWireframe
Reveal Obstacles mode cannot be set for the view because wireframe display style is set for the view.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.RevealObstaclesModeFailureDataExist
Reveal Obstacles mode cannot be set for the view because analysis data exist in the view.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.TooMuchGeometry
The view is exporting too much geometry. Calculation of the path of travel cannot be performed.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.PointOutsideActiveCrop
Start or end point is outside the active view crop.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.StartAndEndPointsTooClose
Distance between adjacent points of path of travel (start, end and way points) is less than the value of Autodesk::Revit::DB::Analysis::RouteAnalysisSettings::MinimumLength.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.ResultAffectedByCrop
The view has an active crop region set. If Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop contains no points,
no path of travel was found inside the crop region, but a valid path may exist outside of it.
If Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop contains valid points, a path of travel was found inside the
crop region, but a better option may exist outside of it.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.SplitView
The view is split. Calculation of the path of travel cannot be performed.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.AreaTooLarge
The view outline is too large. Calculation of the path of travel cannot be performed.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.NoPathOfTravel
There is no valid path between the two points.

Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.Success
A valid path of travel between the two points was found. Use Autodesk::Revit::DB::Analysis::PathOfTravel::GetCurveLoop
to retrieve the calculated points of path of travel.